<details>
<summary>Execution result of "run plan --all" in "."</summary>

```terraform
23:03:12.682 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./management-account/eu-west-1/s3
- Module ./management-account/global-infra/organization-accounts
- Module ./playground-account/eu-west-1/s3
- Module ./test-account/eu-west-1/s3


23:03:12.829 INFO   [management-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./management-account/eu-west-1/s3/.terragrunt-cache/6O7bSTWfYv7WPnJvTEak2cevHGQ/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:03:12.831 INFO   [management-account/global-infra/organization-accounts] Downloading Terraform configurations from ./modules/organization-account into ./management-account/global-infra/organization-accounts/.terragrunt-cache/3XLPvzLN2Hf8668drqHKYhDUbDk/Yycl6dC0BtLQ-XFNjTw2ySiFaUQ
23:03:12.834 INFO   [test-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./test-account/eu-west-1/s3/.terragrunt-cache/FIgbXJVdUJAkmsa6YIf24Zbjalw/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:03:12.838 INFO   [playground-account/eu-west-1/s3] Downloading Terraform configurations from ./modules/s3 into ./playground-account/eu-west-1/s3/.terragrunt-cache/Ife-siSQSkZudNuf1ioRzK__ydI/p0hmT_yU9GfVIbcsvydhmNhIJWg
23:03:13.390 INFO   [test-account/eu-west-1/s3] terraform: Initializing the backend...
23:03:13.392 INFO   [management-account/eu-west-1/s3] terraform: Initializing the backend...
23:03:13.394 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing the backend...
23:03:13.397 INFO   [playground-account/eu-west-1/s3] terraform: Initializing the backend...
23:03:14.311 INFO   [test-account/eu-west-1/s3] terraform: 
23:03:14.311 INFO   [test-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:03:14.311 INFO   [test-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:03:14.356 INFO   [management-account/eu-west-1/s3] terraform: 
23:03:14.356 INFO   [management-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:03:14.356 INFO   [management-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:03:14.378 INFO   [playground-account/eu-west-1/s3] terraform: 
23:03:14.378 INFO   [playground-account/eu-west-1/s3] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:03:14.378 INFO   [playground-account/eu-west-1/s3] terraform: use this backend unless the backend configuration changes.
23:03:14.379 INFO   [management-account/global-infra/organization-accounts] terraform: 
23:03:14.379 INFO   [management-account/global-infra/organization-accounts] terraform: Successfully configured the backend "s3"! Terraform will automatically
23:03:14.379 INFO   [management-account/global-infra/organization-accounts] terraform: use this backend unless the backend configuration changes.
23:03:14.649 INFO   [test-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:03:14.649 INFO   [test-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:03:14.714 INFO   [management-account/global-infra/organization-accounts] terraform: Initializing provider plugins...
23:03:14.714 INFO   [management-account/global-infra/organization-accounts] terraform: - Finding latest version of hashicorp/aws...
23:03:14.736 INFO   [management-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:03:14.736 INFO   [management-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:03:14.736 INFO   [playground-account/eu-west-1/s3] terraform: Initializing provider plugins...
23:03:14.736 INFO   [playground-account/eu-west-1/s3] terraform: - Finding latest version of hashicorp/aws...
23:03:14.762 INFO   [test-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:03:14.845 INFO   [management-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:03:14.848 INFO   [management-account/global-infra/organization-accounts] terraform: - Installing hashicorp/aws v6.0.0...
23:03:14.924 INFO   [playground-account/eu-west-1/s3] terraform: - Installing hashicorp/aws v6.0.0...
23:03:20.745 INFO   [test-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:03:20.746 INFO   [test-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:03:20.746 INFO   [test-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:03:20.746 INFO   [test-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:03:20.746 INFO   [test-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:03:20.747 INFO   [test-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:03:20.907 INFO   [management-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:03:20.907 INFO   [management-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:03:20.907 INFO   [management-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:03:20.907 INFO   [management-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:03:20.907 INFO   [management-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:03:20.995 INFO   [management-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:03:21.352 INFO   [playground-account/eu-west-1/s3] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:03:21.352 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:03:21.352 INFO   [playground-account/eu-west-1/s3] terraform: selections it made above. Include this file in your version control repository
23:03:21.352 INFO   [playground-account/eu-west-1/s3] terraform: so that Terraform can guarantee to make the same selections by default when
23:03:21.352 INFO   [playground-account/eu-west-1/s3] terraform: you run "terraform init" in the future.
23:03:21.352 INFO   [playground-account/eu-west-1/s3] terraform: Terraform has been successfully initialized!
23:03:21.424 INFO   [management-account/global-infra/organization-accounts] terraform: - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)
23:03:21.424 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
23:03:21.424 INFO   [management-account/global-infra/organization-accounts] terraform: selections it made above. Include this file in your version control repository
23:03:21.424 INFO   [management-account/global-infra/organization-accounts] terraform: so that Terraform can guarantee to make the same selections by default when
23:03:21.424 INFO   [management-account/global-infra/organization-accounts] terraform: you run "terraform init" in the future.
23:03:21.424 INFO   [management-account/global-infra/organization-accounts] terraform: Terraform has been successfully initialized!
23:03:26.770 STDOUT [management-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-main-account]
23:03:26.946 STDOUT [test-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt-test-account]
23:03:27.091 STDOUT [management-account/global-infra/organization-accounts] terraform: aws_organizations_account.this: Refreshing state... [id=929864627295]
23:03:27.476 STDOUT [playground-account/eu-west-1/s3] terraform: aws_s3_bucket.this: Refreshing state... [id=ma-test-bucket-terragrunt]
23:03:27.724 STDOUT [management-account/global-infra/organization-accounts] terraform: No changes. Your infrastructure matches the configuration.
23:03:27.724 STDOUT [management-account/global-infra/organization-accounts] terraform: Terraform has compared your real infrastructure against your configuration
23:03:27.724 STDOUT [management-account/global-infra/organization-accounts] terraform: and found no differences, so no changes are needed.
23:03:28.618 STDOUT [management-account/eu-west-1/s3] terraform: No changes. Your infrastructure matches the configuration.
23:03:28.618 STDOUT [management-account/eu-west-1/s3] terraform: Terraform has compared your real infrastructure against your configuration
23:03:28.618 STDOUT [management-account/eu-west-1/s3] terraform: and found no differences, so no changes are needed.
23:03:28.762 STDOUT [test-account/eu-west-1/s3] terraform: No changes. Your infrastructure matches the configuration.
23:03:28.762 STDOUT [test-account/eu-west-1/s3] terraform: Terraform has compared your real infrastructure against your configuration
23:03:28.762 STDOUT [test-account/eu-west-1/s3] terraform: and found no differences, so no changes are needed.
23:03:29.374 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform used the selected providers to generate the following execution
23:03:29.374 STDOUT [playground-account/eu-west-1/s3] terraform: plan. Resource actions are indicated with the following symbols:
23:03:29.374 STDOUT [playground-account/eu-west-1/s3] terraform: -/+ destroy and then create replacement
23:03:29.374 STDOUT [playground-account/eu-west-1/s3] terraform: Terraform will perform the following actions:
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:   # aws_s3_bucket.this must be replaced
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform: -/+ resource "aws_s3_bucket" "this" {
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       + acceleration_status         = (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       + acl                         = (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ arn                         = "arn:aws:s3:::ma-test-bucket-terragrunt" -> (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ bucket                      = "ma-test-bucket-terragrunt" -> jsonencode(
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:             [
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:               + "ma-bucket-one-altamash",
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:               + "ma-bucket-two-altamash",
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:             ]
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:         )
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ bucket_domain_name          = "ma-test-bucket-terragrunt.s3.amazonaws.com" -> (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       + bucket_prefix               = (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ bucket_region               = "eu-west-1" -> (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ bucket_regional_domain_name = "ma-test-bucket-terragrunt.s3.eu-west-1.amazonaws.com" -> (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ hosted_zone_id              = "Z1BKCTXD74EZPE" -> (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ id                          = "ma-test-bucket-terragrunt" -> (known after apply)
23:03:29.375 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ object_lock_enabled         = false -> (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       + policy                      = (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ request_payer               = "BucketOwner" -> (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:         tags                        = {
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:             "Environment" = "test-env"
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:             "Name"        = "ma-test-bucket-tag"
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_domain              = (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       + website_endpoint            = (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:         # (3 unchanged attributes hidden)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ cors_rule (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ grant (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       - grant {
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:           - id          = "930454f06437e7fdb90b65c7ecea90969c129dcffb5f63020b02e1295aa3c04d" -> null
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:           - permissions = [
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:               - "FULL_CONTROL",
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:             ] -> null
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:           - type        = "CanonicalUser" -> null
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:             # (1 unchanged attribute hidden)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ lifecycle_rule (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ logging (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ object_lock_configuration (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ replication_configuration (known after apply)
23:03:29.376 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ server_side_encryption_configuration (known after apply)
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:       - server_side_encryption_configuration {
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:           - rule {
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:               - bucket_key_enabled = false -> null
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:               - apply_server_side_encryption_by_default {
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:                   - sse_algorithm     = "AES256" -> null
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:                     # (1 unchanged attribute hidden)
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:                 }
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:             }
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ versioning (known after apply)
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:       - versioning {
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:           - enabled    = false -> null
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:           - mfa_delete = false -> null
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:         }
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:       ~ website (known after apply)
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:     }
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform: Plan: 1 to add, 0 to change, 1 to destroy.
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform: 
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform: Changes to Outputs:
23:03:29.377 STDOUT [playground-account/eu-west-1/s3] terraform:   ~ bucket_id = "ma-test-bucket-terragrunt" -> (known after apply)
```

</details>
    
